
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МакетПостроенияФормы = ПолучитьОбщийМакет("СозданиеЭлементовФаксимиле");
	ТекстСборки          = МакетПостроенияФормы.ПолучитьТекст();
	Читаем = Новый ЧтениеXML;
	Читаем.УстановитьСтроку(ТекстСборки);
	ОбъектДляПостройки = ФабрикаXDTO.ПрочитатьXML(Читаем);	
	ДополнительныеПараметры = СборкаФормСервер.ПолучитьДоппареметрыДляСбораФормы();
	ДополнительныеПараметры.СтроитьРеквизиты = истина;
	ДополнительныеПараметры.СтроитьКоманды   = истина;
	ДополнительныеПараметры.СтроитьПодчиненныеЭлементы   = истина;
	
	СборкаФормСервер.СобратьГруппуЭлементовИзXML(этаФорма,ОбъектДляПостройки,"","ГруппаФаксимильнаяПечать",ДополнительныеПараметры);
	
КонецПроцедуры
