//////////////////////////////////////////////////////////////////////////////////
//
//	Модуль Динамического Формирования Интерфейса
//	Версия 2.0.0.1 Начало разработки 26.03.2020 года
//	
//	Разработчик модуля: Котов Дмитрий Вадимович
//	Инфостарт https://infostart.ru/profile/564942/
//	telegram: @KotovDima
//	instagram: @KotovDima1C
//
//////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция СтруктураЗагружаемыхЭлементовФормы() Экспорт
	
	СтруктураЗагружаемыхЭлементов = Новый Структура;
	
	#Область Реквизиты_формы
	Параметры = Новый Структура;
	Свойства = Новый Структура; // свойства объекта для чтения
	Свойства.Вставить("Name", "Имя");
	Свойства.Вставить("Synonym", "Синоним");
	Свойства.Вставить("Comment", "Комментарий");
	Параметры.Вставить("Properties", Свойства); 
	СтруктураЗагружаемыхЭлементов.Вставить("Attributes", Параметры);
	
	#КонецОбласти
	//- Реквизиты
	
	
	#Область Команды_формы
	
	ЗначенияСвойств = Новый Соответствие;
	ЗначенияСвойств.Вставить("ModifiesSavedData",КоллекцияБулево());
	ЗначенияСвойств.Вставить("CurrentRowUse",КоллекцияИспользованиеТекущейСтроки());
	
	
	// Объект картинки
	Структура = новый структура;
	Структура.Вставить("ref",КоллекцияБиблиотекаКартинок());
	Структура.Вставить("LoadTransparent",КоллекцияБулево());
	ЗначенияСвойств.Вставить("Picture",Структура);
	
	
	Параметры = Новый Структура;
	Свойства = Новый Структура; // свойства объекта для чтения
	Свойства.Вставить("Name", "Имя");
	Свойства.Вставить("Action", "Действие");
	Свойства.Вставить("CurrentRowUse", "ИспользованиеТекущейСтроки");
	Свойства.Вставить("Picture", "Картинка");
	
	
	Свойства.Вставить("Synonym", "Синоним");
	Свойства.Вставить("Comment", "Комментарий");
	Свойства.Вставить("ModifiesSavedData", "ИзменяетСохраняемыеДанные");
	Параметры.Вставить("Properties", Свойства); 
	Параметры.Вставить("ЗначенияСвойств", ЗначенияСвойств); 
	
	СтруктураЗагружаемыхЭлементов.Вставить("Command", Параметры);
	#КонецОбласти
	
	    #Область Подчиненные_элементы
	ЗначенияСвойств = Новый Соответствие;
	ЗначенияСвойств.Вставить("Group",ГруппировкаПодчиненныхЭлементовФормы());
	ЗначенияСвойств.Вставить("Width", КоллекцияЧисел());
	ЗначенияСвойств.Вставить("Height", КоллекцияЧисел());

ЗначенияСвойств.Вставить("ТипыКнопок", КоллекцияВидовКнопкиФормы());
	
	
	Параметры = Новый Структура;
	Свойства = Новый Структура; // свойства объекта для чтения
	Свойства.Вставить("Group", "Группировка");
	Свойства.Вставить("Width", "Ширина");
	Свойства.Вставить("Height", "Высота");
	Свойства.Вставить("DataPath", "ПутьКданным");
	Свойства.Вставить("Hyperlink", "ПутьКданным");



	Свойства.Вставить("ТипыКнопок", "ТипыКнопок");


	
	Параметры.Вставить("Properties", Свойства);
	
	Параметры.Вставить("ЗначенияСвойств", ЗначенияСвойств); 
	СтруктураЗагружаемыхЭлементов.Вставить("ChildItems", Параметры);

		#КонецОбласти 
	
	Возврат СтруктураЗагружаемыхЭлементов;
	
КонецФункции 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ГруппировкаПодчиненныхЭлементовФормы()
	Группировка = Новый Структура;
	Группировка.Вставить("Vertical",ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	Группировка.Вставить("AlwaysHorizontal",ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	 Группировка.Вставить("Horizontal",ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);

	Группировка.Вставить("HorizontalIfPossible",ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	Возврат Группировка;
КонецФункции

Функция КоллекцияБулево()
	
	Возврат Новый Структура("true,false",Истина,Ложь);
	
КонецФункции

Функция КоллекцияЧисел()
	
	Числа = Новый Соответствие;
	
	Числа.Вставить("7",7);
	Числа.Вставить("41",41);
	Числа.Вставить("42",42);

	Возврат Числа;
	
КонецФункции

Функция КоллекцияВидовКнопкиФормы()
	ВидыКнопок = Новый Структура;
	ВидыКнопок.Вставить("CommandBarButton",ВидКнопкиФормы.КнопкаКоманднойПанели);
		ВидыКнопок.Вставить("Hyperlink",ВидКнопкиФормы.Гиперссылка);

	Возврат  ВидыКнопок;
КонецФункции

Функция КоллекцияВидовПолейФормы()
	ВидыПолей = Новый Структура;
	//ВидыПолей.Вставить("CommandBarButton",ВидПоляФормы.);
	Возврат  ВидыПолей;
КонецФункции

 
// системное перечисление ИспользованиеТекущейСтроки
Функция КоллекцияИспользованиеТекущейСтроки()
	Результат = новый Структура;
	Результат.Вставить("DontUse",ИспользованиеТекущейСтроки.НеИспользует);
	Результат.Вставить("Use",ИспользованиеТекущейСтроки.Использует);
	Результат.Вставить("Auto",ИспользованиеТекущейСтроки.Авто);
	
	Возврат Результат;
КонецФункции

//Библиотека картинок
Функция КоллекцияБиблиотекаКартинок()
	СоответствиеКартинок = Новый Соответствие;
	СоответствиеКартинок.Вставить("StdPicture.CreateListItem",БиблиотекаКартинок.СоздатьЭлементСписка);
	СоответствиеКартинок.Вставить("StdPicture.Change",БиблиотекаКартинок.Изменить);
	СоответствиеКартинок.Вставить("StdPicture.InputFieldOpen",БиблиотекаКартинок.ПолеВводаОткрыть);
	СоответствиеКартинок.Вставить("StdPicture.Delete",БиблиотекаКартинок.Удалить);
	Возврат  СоответствиеКартинок;
КонецФункции


#КонецОбласти

